// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.

double PowerAB(int a, int b) {
    return Math.Pow((a), b);
}

Console.WriteLine("Enter two numbers one by one:");
int a = Convert.ToInt32(Console.ReadLine());
int b = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Result is " + PowerAB(a, b));

//Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.



//Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.


