// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.


// void ShowNumber() {
//     Console.Clear();

//     Console.WriteLine("Enter 3 digits number:");
//     int number = Convert.ToInt32(Console.ReadLine());

//     number = number/10;
//     number = number%10;

//     Console.WriteLine("Second digit" + "->" + number);
    
// }

// ShowNumber();


// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.





// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.