// Задайте двумерный массив размером m×n, заполненный случайными вещественными числами.

// double[,] CreateRandomArray( int m, int n, int min, int max)
// {
//     double[,] array = new double[m, n];


//     for (int i = 0; i < m; i++)
//     {
//         for (int j = 0; j < n; j++)
//         {
//             array[i, j] = Math.Round(new Random().NextDouble() * new Random().Next(min, max), 2);

//         }
//     }
//     return array;
// }

// void ShowArray(double[,] array)
// {
//     for (int i = 0; i < array.GetLength(0); i++)
//     {
//         for (int j = 0; j < array.GetLength(1); j++)
//         {
//             Console.Write(array[i, j] + " ");
//         }
//         Console.WriteLine();
//     }
// }


// double[,] myArray = CreateRandomArray(3, 4, -5, 5);

// ShowArray(myArray);



//Напишите программу, которая на вход принимает позиции элемента в двумерном массиве, 
//и возвращает значение этого элемента или же указание, что такого элемента нет.





//Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце



